<?php

use Tests\TestCase;
use Illuminate\Foundation\Testing\RefreshDatabase;

/*
|--------------------------------------------------------------------------
| Test Case
|--------------------------------------------------------------------------
|
| Здесь мы указываем Pest, что все тесты в папке "Feature" должны
| автоматически использовать базовый класс TestCase и трейт
| RefreshDatabase. Таким образом, в самих тестовых файлах
| строку uses() писать больше не нужно.
|
*/

uses(TestCase::class, RefreshDatabase::class)->in('Feature');

/*
|--------------------------------------------------------------------------
| Expectations
|--------------------------------------------------------------------------
|
| Пример пользовательского "expect()" метода, который можно вызывать
| в тестах как expect($value)->toBeOne();
|
*/

expect()->extend('toBeOne', function () {
    return $this->toBe(1);
});

/*
|--------------------------------------------------------------------------
| Global Functions
|--------------------------------------------------------------------------
|
| Если нужно добавить глобальные функции для тестов, можешь описывать
| их здесь, чтобы не дублировать код.
|
*/

function something()
{
    // ...
}
